Revit 2027 API
ExportFontTable.GetExportFontInfo Method
 Gets a copy of the font info associated to the input font key.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportFontInfo GetExportFontInfo(
	ExportFontKey exportFontKey
)
Public Function GetExportFontInfo (
	exportFontKey As ExportFontKey
) As ExportFontInfo
public:
ExportFontInfo^ GetExportFontInfo(
	ExportFontKey^ exportFontKey
)
member GetExportFontInfo :
        exportFontKey : ExportFontKey -> ExportFontInfo
Parameters
exportFontKey ExportFontKey
 The export font Key.
Return Value
ExportFontInfo
 Returns the fontInfo for this key.
Exceptions
Exception | Condition
ArgumentException |  An entry with the given key is not present in the table.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportFontTable Class
Autodesk.Revit.DB Namespace